InformationRegisters/ДостиженияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДостиженияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выдано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Достижение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Достижения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбщегоНазначенияВызовСервера/Ext/Module.bsl
// Возвращает текущего пользователя системы.
Функция ТекущийПользователь() Экспорт
	РезультатФункции = ПараметрыСеанса.ТекущийПользователь;
	Возврат РезультатФункции;
КонецФункции		// ТекущийПользователь()	

// Устарела. Следует использовать функцию ОбщегоНазначения.ЗначенияРеквизитовОбъекта 
Функция ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	" + ИменаРеквизитов + "
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Результат = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Функция ПолучитьЗначениеРеквизита возвращает значение
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ПолучитьЗначенияРеквизитов(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Определяет наличие в базе сборника с идентификатором ИдентификаторВход.
Функция ЕстьСборникСИдентификатором(ИдентификаторВход) Экспорт
	РезультатФункции = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборники.Ссылка КАК Ссылка,
		|	Сборники.ИдентификаторСборника КАК ИдентификаторСборника
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	Сборники.ИдентификаторСборника = &ИдентификаторСборника
		|	И НЕ Сборники.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИдентификаторСборника", ИдентификаторВход);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатФункции = (НЕ РезультатЗапроса.Пустой());
	Возврат РезультатФункции;
КонецФункции		// ЕстьСборникСИдентификатором()

// Загружает предопределенный макет в базу. Возвращает успешность выполнения операции.
Функция ЗагрузитьПредопределенныйМакет() Экспорт
	РезультатФункции = Истина;
	Попытка
		МакетДвоичный = ПолучитьОбщийМакет("Сборник_Предопределенный");
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		МакетДвоичный.Записать(ИмяВременногоФайла);
		РезультатФункции = Обработки.ПереносСборников.ЗагрузитьСборник_Сервер(ИмяВременногоФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'При загрузке предопределённого сборника произошли ошибки: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		Сообщить(ТекстСообщения);
		РезультатФункции = Ложь;
	КонецПопытки;
	Возврат РезультатФункции;
КонецФункции		// ЗагрузитьПредопределенныйМакет()

// Производит начальное зхаполнение констант.
Процедура УстановитьЗначениеКонстант() Экспорт
	КоличествоЗаданий = Константы.КоличествоЗаданийВРаунде.Получить();
	Если НЕ ЗначениеЗаполнено(КоличествоЗаданий) Тогда
		Константы.КоличествоЗаданийВРаунде.Установить(100);
	Иначе
		// Значение установлено.
	КонецЕсли;
КонецПроцедуры		// УстановитьЗначениеКонстант()

// Устанавливает пользователю ПользовательВход достижение ДостижениеВход
// текущей датой.
Процедура ВыдатьДостижение(ПользовательВход, ДостижениеВход) Экспорт
	НаборЗаписей = РегистрыСведений.ДостиженияПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПользовательВход); 
	НаборЗаписей.Отбор.Достижение.Установить(ДостижениеВход); 
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Пользователь = ПользовательВход; 
	НоваяЗапись.Достижение = ДостижениеВход; 
	НоваяЗапись.Выдано = Истина;
	НоваяЗапись.ДатаВыдачи = ТекущаяДата();
	НаборЗаписей.Записать(); 
КонецПроцедуры		// ВыдатьДостижение() 

// Возвращает соответствие дат получения достижениям пользователя
// ПользовательВход.
Функция ПолучитьСоответствиеДостиженияПользователей(ПользовательВход) Экспорт
	РезультатФункции = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДостиженияПользователей.Пользователь КАК Пользователь,
		|	ДостиженияПользователей.Достижение КАК Достижение,
		|	ДостиженияПользователей.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.ДостиженияПользователей КАК ДостиженияПользователей
		|ГДЕ
		|	ДостиженияПользователей.Пользователь = &Пользователь
		|	И ДостиженияПользователей.Выдано";
	Запрос.УстановитьПараметр("Пользователь", ПользовательВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции.Вставить(ВыборкаДетальныеЗаписи.Достижение, ВыборкаДетальныеЗаписи.ДатаВыдачи);
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 // ПолучитьСоответствиеДостиженияПользователей()	

// Возвращает массив всех достижений пользователя ПользовательВход.
Функция ПолучитьМассивДостиженийПользователя(ПользовательВход) Экспорт
	РезультатФункции = Новый Массив;
	СоответствиеДостижений = ПолучитьСоответствиеДостиженияПользователей(ПользовательВход);
	Для Каждого ТекСоответствиеДостижений Из СоответствиеДостижений Цикл
		РезультатФункции.Добавить(ТекСоответствиеДостижений.Ключ);
	КонецЦикла;	
	РезультатФункции = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РезультатФункции);
	Возврат РезультатФункции;
КонецФункции		// ПолучитьМассивДостиженийПользователя()

// Проверяет наличие у пользователя ПользовательВход достижения ДостижениеВход.
Функция ЕстьДостижениеПользователя(ПользовательВход, ДостижениеВход, МассивДостиженийВход = Неопределено) Экспорт
	РезультатФункции = Ложь;
	МассивДостижений = Новый Массив;
	Если МассивДостиженийВход = Неопределено Тогда
		МассивДостижений = ПолучитьМассивДостиженийПользователя(ПользовательВход);
	Иначе
		МассивДостижений = МассивДостиженийВход;
	КонецЕсли;
	НайденноеДостижение = МассивДостижений.Найти(ДостижениеВход);
	РезультатФункции = (НайденноеДостижение <> Неопределено);
	Возврат РезультатФункции;
КонецФункции		// ЕстьДостижениеПользователя()

// Проверяет наличие у пользователя ПользовательВход достижения
// ДостижениеВход и выдаёт его ему в случае отсутствия.
Процедура ПроверитьИВыдатьДостижениеПользователю(ПользовательВход, ДостижениеВход) Экспорт
	РезультатПроверки = ЕстьДостижениеПользователя(ПользовательВход, ДостижениеВход);
	Если НЕ РезультатПроверки Тогда
		ВыдатьДостижение(ПользовательВход, ДостижениеВход);
		ТекстСообщения = "";
		ТекстСообщения = ТекстСообщения + "Вы получили достижение ";
		ТекстСообщения = ТекстСообщения + Строка(ДостижениеВход);
		ТекстСообщения = ТекстСообщения + ". Поздравляем!";
		Сообщить(ТекстСообщения);
	Иначе
		// Уже есть такое достижение, не обновляем.
	КонецЕсли;
КонецПроцедуры		// ПроверитьИВыдатьДостижениеПользователю()

// Возвращает количество сборников, установленных в системе.
Функция ОпределитьКоличествоУстановленныхСборников() Экспорт
	РезультатФункции = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сборники.Ссылка) КАК КоличествоСсылок
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции = ВыборкаДетальныеЗаписи.КоличествоСсылок;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 // ОпределитьКоличествоУстановленныхСборников()
